In [1]:
import numpy as np 
import pandas as pd

In [55]:
dates = pd.date_range('20130101', periods=6)

In [56]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [57]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [95]:
df

                   A         B         C         D
2013-01-01  0.078048  0.335949  2.355030 -0.171069
2013-01-02  0.541171 -1.593667 -1.320517 -0.825059
2013-01-03 -0.792030 -0.811659 -1.173412 -0.145112
2013-01-04  0.084761  0.497023  0.863392 -0.437208
2013-01-05  0.308487 -1.857411 -1.996898  0.243347
2013-01-06 -0.636380 -1.052774 -0.965930  0.107144

In [91]:
s = [1,2,3,4,5,6]

In [86]:
s = np.array(s)

In [87]:
s

array([1, 2, 3, 4, 5, 6])

In [88]:
s = pd.Series(s, index=['A','B','C','D','E','F'], name="e")

In [89]:
s

A    1
B    2
C    3
D    4
E    5
F    6
Name: e, dtype: int64

In [66]:
e = pd.DataFrame(s, index = dates, columns=list('E'))

In [67]:
e

             E
2013-01-01 NaN
2013-01-02 NaN
2013-01-03 NaN
2013-01-04 NaN
2013-01-05 NaN
2013-01-06 NaN

In [92]:
df2 = pd.DataFrame(s, index=dates, columns=list('E'))

In [93]:
df2

            E
2013-01-01  1
2013-01-02  2
2013-01-03  3
2013-01-04  4
2013-01-05  5
2013-01-06  6

In [98]:
df3 = pd.concat([df, df2], axis=1)

                   A         B         C         D  E
2013-01-01  0.078048  0.335949  2.355030 -0.171069  1
2013-01-02  0.541171 -1.593667 -1.320517 -0.825059  2
2013-01-03 -0.792030 -0.811659 -1.173412 -0.145112  3
2013-01-04  0.084761  0.497023  0.863392 -0.437208  4
2013-01-05  0.308487 -1.857411 -1.996898  0.243347  5
2013-01-06 -0.636380 -1.052774 -0.965930  0.107144  6